{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "El-gendy_CV.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I have <span class='underline'>1 year of experience</span> developing systems, interfaces, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular, .NET ( Web API, MVC )</span> applying good practices and development standards.",
  "Banner.ActionBtn": "Get in touch",
  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "In my <span class='underline'>around 2 years as a developer</span>, I seek to train every day. I have worked writing <span class='underline'>unit tests</span>, <span class='underline'>performing continuous integration</span>, and covering backend developer roles with <span class='underline'>.NET, Web API, MongoDB and SQL Server</span>. I have led teams having empathy, exercising motivation to partners, and setting plans and goals together.",
    "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "PSH",
      "Title": "Software Developer",
      "Date": "May 2023 - Present",
      "Description": [
        "Developed and maintained a web-based application using Angular, .NET, and SQL Server, resulting in improved user experience and increased performance.",
        "Designed and implemented RESTful APIs to support multiple applications, using .NET Web API.",
        "Built a real-time chat application using WebSockets and Node.js, increasing communication and collaboration among team members.",
        "Implementation of continuous integration and daily backups.",
        "Leading a team of 4 people in the development of a E-commerce platform made in Angular, Web API, and SQL Server.",
        "Planning meetings in reports."
      ]
    },
    {
      "Tab": "Freelancer",
      "Title": "Independent",
      "Date": "Jan 2023 - Present",
      "Description": [
        "Implementing continuous improvements, working on frontend and backend.",
        "Creating platforms with Angular, MVC, Web API programmed with functional, reactive, and object-oriented programming paradigms.",
        "Automation of processes with data structures.",
        "Design layout with SASS, Bootstrap, Materialize, etc."
      ]
    }
  ],
  "FeatureProjects.Title": "Projects that I was a part of",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "2x School",
      "Description": "A Next Generation School Management System application made from scratch with auth module, <span class='underline'>configurable graphics</span>, <span class='underline'>configurable alarms</span>, and <span class='underline'>user management</span>. It also has feedback form logic for parameter configuration.",
      "imgs": [
        "assets/images/school/image1.png",
        "assets/images/school/image2.png"
      ],
      "Technologies": ["Angular", "SASS", "Angular Material", "RxJS"]
    },
    {
      "Title": "Best Buy Mall",
      "Description": "Best Buy Mall is Online Shopping Mall where you can buy your groceries and household products from your favourite local stores. It has <span class='underline'>online chat, </span, <span class='underline'> &nbsp;order history</span>, <span class='underline'>notification system on number and mail</span>, <span class='underline'>auth</span>, and <span class='underline'>stripe integration for secure payments.</span>",
      "imgs": ["assets/images/bbm/image1.png", "assets/images/bbm/image2.png"],
      "Technologies": ["Angular", "SASS", "Material", "RxJS", "Web API"]
    },
    {
      "Title": " Mazhr",
      "Description": " Mazhr is a Finnish Intelligent Potential and Talent Management company. that help organizations to build better and more efficient teams by matching their  <span class='underline'>Talent</span> and <span class='underline'>Potentials</span>. It has various installations made from scratch with auth module, <span class='underline'>configurable graphics</span>, <span class='underline'>configurable alarms</span>, <span class='underline'>user management</span>, and <span class='underline'>geolocation with openlayers.</span>",
      "imgs": ["assets/images/mazhr/image1.png"],
      "Technologies": ["Angular", "SASS", "Material", "Babel", "Web API"]
    },
    {
      "Title": "Needle",
      "Description": "Needle Music is a pioneer in the digital music industry as it allows users to create and manage their first and only Audiobiography. It built with the <span class='underline'>Spotify SDK</span> Integration.",
      "imgs": ["assets/images/mazhr/needle.png"],
      "demoLink": "https://profile.needlemusic.co/bub",
      "Technologies": ["Angular", "ChartJS", "SASS", "Web API"]
    }
  ],
  "OtherProjects.Title": "More personal projects",
  "OtherProjects.Projects": [
    {
      "Title": "Covid Tracker",
      "Description": "Covid Tracker is a web app which is built using the 3rd Party Api integration. This app shows the records from worldwise and countrywise that shows the who much patient are suffer from covid who many died from covid and how many are recoverd from covid",
      "ghLink": "",
      "demoLink": "",
      "Technologies": ["Angular", "RxJs", "Web API", "Bootstrap"]
    },
    {
      "Title": "Lets Chat",
      "Description": "A real-time chat application. Another fun side project :)",
      "ghLink": "",
      "Technologies": ["Angular", "SASS", "Socket.io", "Web API", "SQL Server"]
    },
    {
      "Title": "Quiz App",
      "Description": "A single page quiz app that has a minimal design, that has different level to attempt quizes.",
      "ghLink": "",
      "demoLink": "",
      "Technologies": [
        "Angular",
        "SASS",
        "TypeScript",
        "Web API",
        "3rd Party Library"
      ]
    },
    {
      "Title": "JWT Integration",
      "Description": "JWT AUTHENTICATION IN NODE JS WITH POSTGREESQL DB",
      "ghLink": "",
      "demoLink": "",
      "Technologies": ["Angular", "JWT", "Web API", "SQL Server"]
    }
  ],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
  "Contact.Btn": "Say Hello"
}
